[{"id": 16261, "title": "SpaceX to squeeze in Falcon 9 Starlink launch before NASA’s Moon rocket debut", "url": "https://www.teslarati.com/spacex-falcon-9-starlink-launch-before-nasa-moon-rocket/", "imageUrl": "https://www.teslarati.com/wp-content/uploads/2022/08/KPLO-F9-B1052-LC-40-080422-SLS-Artemis-I-39B-081922-Richard-Angle-1-crop-2-c.jpg", "newsSite": "Teslarati", "summary": "SpaceX is preparing for at least one more Falcon 9 launch between now and the debut of NASA’s Space Launch System (SLS)...", "publishedAt": "2022-08-24T04:52:17.000Z", "updatedAt": "2022-08-25T07:20:43.990Z", "featured": false, "launches": [{"id": "67158b3c-201d-4450-be8a-990010c05b40", "provider": "Launch Library 2"}], "events": []}, {"id": 16265, "title": "Watch live: SpaceX readies Falcon 9 rocket for weekend launch", "url": "https://spaceflightnow.com/2022/08/25/watch-live-spacex-readies-falcon-9-rocket-for-weekend-launch/", "imageUrl": "https://spaceflightnow.com/wp-content/uploads/2022/08/20220825f9static1.jpg", "newsSite": "Spaceflight Now", "summary": "SpaceX has rolled a Falcon 9 rocket to its launch pad at Cape Canaveral for a test-firing ahead of a planned mission Saturday night carrying another group of Starlink internet satellites into orbit. A static fire test is planned for 9:10 a.m. EDT (1310 GMT) on Space Launch Complex 40 at Cape Canaveral Space Force Station. Assuming the test is successful, the Falcon 9 rocket is set to lift off Saturday at 10:22 p.m. EDT (0222 GMT Sunday). The mission will be the final launch from Florida’s Space Coast before NASA is set to launch the Artemis 1 mission from the Kennedy Space Center — a few miles north of pad 40 — as soon as Monday morning. The Falcon 9 launch Saturday night will mark the 38th SpaceX mission of the year, and the 57th Falcon 9 flight primarily dedicated to deploying satellites for the Starlink internet network. SpaceX has launched more than 3,100 Starlink satellites to date, and Saturday’s flight is expected to add another 53 spacecraft to the fleet. SpaceX plans to", "publishedAt": "2022-08-25T12:51:07.000Z", "updatedAt": "2022-08-25T12:54:37.518Z", "featured": false, "launches": [{"id": "67158b3c-201d-4450-be8a-990010c05b40", "provider": "Launch Library 2"}], "events": []}]